In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
#from datetime import datetime

In [2]:
df = pd.read_table("ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt", delim_whitespace=True, comment='#' , header=None)

In [3]:
df.head()

      0  1         2       3       4       5  6
0  1958  3  1958.208  315.71  315.71  314.62 -1
1  1958  4  1958.292  317.45  317.45  315.29 -1
2  1958  5  1958.375  317.50  317.50  314.71 -1
3  1958  6  1958.458  -99.99  317.10  314.85 -1
4  1958  7  1958.542  315.86  315.86  314.98 -1

In [4]:
new_df = df.loc[:,[0,1,3]]

In [5]:
new_names = ['year', 'month', 'co2']

In [6]:
new_df.columns =new_names

In [7]:
new_df.head()

   year  month     co2
0  1958      3  315.71
1  1958      4  317.45
2  1958      5  317.50
3  1958      6  -99.99
4  1958      7  315.86

### Filling up -99.99 by Na

In [8]:
new_df.iloc[3,2]

-99.99

In [9]:
new_df.shape[0]

735

In [10]:
for value in range(new_df.shape[0]):
     if new_df.iloc[value, 2] == -99.99:
            new_df.iloc[value, 2] = np.nan

In [11]:
new_df.head()

   year  month     co2
0  1958      3  315.71
1  1958      4  317.45
2  1958      5  317.50
3  1958      6     NaN
4  1958      7  315.86

In [12]:
new_df['Day'] = 15

In [13]:
new_df.head()

   year  month     co2  Day
0  1958      3  315.71   15
1  1958      4  317.45   15
2  1958      5  317.50   15
3  1958      6     NaN   15
4  1958      7  315.86   15

In [17]:
new_df['date'] = pd.to_datetime((new_df[['year', 'month', 'Day']]).apply(lambda x: \
                                                                 '-'.join([str(x['year']), str(x['month']), \
                                                                            str(x['Day'])]), axis = 1))

In [18]:
new_df.head()

   year  month     co2  Day       date
0  1958      3  315.71   15 1958-03-15
1  1958      4  317.45   15 1958-04-15
2  1958      5  317.50   15 1958-05-15
3  1958      6     NaN   15 1958-06-15
4  1958      7  315.86   15 1958-07-15

In [19]:
new_df.drop('Day', axis = 1).head()

   year  month     co2       date
0  1958      3  315.71 1958-03-15
1  1958      4  317.45 1958-04-15
2  1958      5  317.50 1958-05-15
3  1958      6     NaN 1958-06-15
4  1958      7  315.86 1958-07-15

In [ ]:
new_df.groupby('year').mean()['co2'].head()

### 10

In [30]:
df.iloc[ list(np.where(df.iloc[:,3]==-99.99))[0],3 ]=np.nan